src/System/Session.php

SELECT * FROM `rep` WHERE `idrep` = 1005 LIMIT 1
---
    public static function user()
    {
        return \App\User::where('idrep', '=', static::userID())->first();