app/Services/Repositories/Offer/OfferClicksRepository.php

		                ->orderBy('paid', 'DESC')
		                ->paginate(100);
	    } else {
		    return Click::leftJoin('click_vars', 'click_vars.click_id', 'clicks.idclicks')
		                ->leftJoin('conversions', 'conversions.click_id', 'clicks.idclicks')
		                ->join('rep', 'rep.idrep', 'clicks.rep_idrep')
		                ->where('offer_idoffer', $this->offerId)
		                ->when($this->uniqueOnly, fn ($query) => $query->where('clicks.click_type', Click::TYPE_UNIQUE))
		                ->where('rep.lft', '>', $this->user->lft)
		                ->where('rep.rgt', '<', $this->user->rgt)
		                ->whereBetween('clicks.first_timestamp', [$start, $end])
		                ->select($select)
		                ->orderBy('paid', 'DESC')
		                ->paginate(100);
---
SELECT count(*) as aggregate FROM `clicks` left join `click_vars` on `click_vars`.`click_id` = `clicks`.`idclicks` left join `click_geo` on `click_geo`.`click_id` = `clicks`.`idclicks` left join `conversions` on `conversions`.`click_id` = `clicks`.`idclicks` inner join `rep` on `rep`.`idrep` = `clicks`.`rep_idrep` WHERE `offer_idoffer` = '979' and `rep`.`lft` > 1 and `rep`.`rgt` < 858 and `clicks`.`first_timestamp` between '2024-11-01 04:00:00' and '2024-12-01 04:59:59'