src/Clicks/URLEvents/ClickRegistrationEvent.php

SELECT * FROM `bonus_offers` WHERE `offer_id` = '990' LIMIT 1
---
    private function checkBonusOfferRequirementMet()
    {
        $bonusOffer = BonusOffer::where('offer_id', '=', $this->offerId)->first();