src/Clicks/URLEvents/ConversionRegistrationEvent.php

    private function registerConversion()
    {
        $conversion = new Conversion($this->clickId);

        if (!$conversion->isValidClick()) {
            throw new InvalidClickException($this->clickId);
        }

        if ($this->customPayout) {
            $conversion->paid = $this->customPayout;
        }


        if (Conversion::isClickConverted($this->clickId)) {
            throw new ClickConvertedException($this->clickId);
        }

        $offer = Offer::find($conversion->clickData->offer_idoffer);
---
SELECT * FROM `offer` WHERE `offer`.`idoffer` = 985 LIMIT 1