app/Http/Controllers/OfferController.php

SELECT * FROM `offer_urls` WHERE `offer_urls`.`company_id` = 52 and `offer_urls`.`company_id` IS not NULL and `status` = 1
SELECT * FROM `offer` WHERE `is_public` = 2 and offer.idoffer NOT IN (SELECT offer_idoffer FROM rep_has_offer WHERE rep_has_offer.rep_idrep = 1005)
SELECT * FROM `offer` WHERE `offer`.`status` = 1
---
	public function showManage()
	{
		$data = array();

		$this->validate(request(), [
			'showInactive' => 'numeric|min:0|max:1'
		]);

		$urls = \App\Company::instance()->first()->offerUrls()->where('status',1)->get();
		/* @var $urls Collection */
		if ($urls->isEmpty()) {
			$url = new OfferURL();
			$url->url = request()->getHttpHost();
			$urls->add($url);
		}
		$urls = $urls->pluck('url')->toArray();
		$data['urls'] = $urls;


		$status = request('showInactive', 0) == 1 ? 0 : 1;
		$offers = \LeadMax\TrackYourStats\System\Session::user()->offers()
		                                                        ->where('offer.status','=', $status)
		                                                        ->leftJoin('campaigns', 'offer.campaign_id', '=', 'campaigns.id')
		                                                        ->select('offer.*', 'campaigns.name as campaign_name');

		if (\LeadMax\TrackYourStats\System\Session::userType() == Privilege::ROLE_AFFILIATE) {
			$offers = $offers->leftJoin('bonus_offers', 'bonus_offers.offer_id', '=', 'offer.idoffer')->get();
			$data['requestableOffers'] = Offer::where('is_public', \LeadMax\TrackYourStats\Offer\Offer::VISIBILITY_REQUESTABLE)
			                                  ->whereRaw('offer.idoffer NOT IN (SELECT offer_idoffer FROM rep_has_offer WHERE rep_has_offer.rep_idrep = ' . \LeadMax\TrackYourStats\System\Session::userID() . ')')->get();
		} else {
			$offers = $offers->get();