src/Offer/Caps.php

SELECT * FROM `user_offer_caps` WHERE `rep_idrep` = '1005' and `offer_idoffer` = '990' LIMIT 1
---
	private function checkUserCap() {
		$offerId = $this->offerID;
		$userId = $this->userID;

		$capped = false;

		$userCapRules = DB::table('user_offer_caps')->where('rep_idrep', '=', $userId)->where('offer_idoffer', '=', $offerId)->first();