src/Offer/Rules.php

SELECT `ip_address` FROM `conversions` left join `clicks` on `conversions`.`click_id` = `clicks`.`idclicks` and `offer_idoffer` = 985 WHERE `first_timestamp` between '2024-12-19 05:00:00' and '2024-12-20 04:59:59'
---
    public function checkAllRules()
    {

        if (empty($this->rules)) {
            return true;
        }

        /*foreach($this->rules as $rule) {
            if ($rule['cap_status']) {
                $cap = $rule['cap'];
                $countryRule = $rule['country_code'];
                $offerId = $rule['offer_idoffer'];

                $tz = 'America/New_York';
                $timeNow = \Illuminate\Support\Carbon::today($tz)->format('Y-m-d');
                $from = $timeNow . " 00:00:00";
                $to = $timeNow . " 23:59:59";

                $carbonFrom = Carbon::createFromFormat('Y-m-d H:i:s', $from, $tz);
                $carbonTo = Carbon::createFromFormat('Y-m-d H:i:s', $to, $tz);
                $dateFrom = $carbonFrom->setTimezone("UTC");
                $dateTo = $carbonTo->setTimezone("UTC");

                $conversions = DB::table('conversions')
                ->whereBetween('first_timestamp', [$dateFrom, $dateTo ])
                ->join('clicks', 'clicks.idclicks', '=', 'conversions.click_id')
                ->where('clicks.offer_idoffer', '=', $offerId)
				->select('ip_address', 'country_code')->get();